brew "fzf"
brew "jq"
brew "yq"
brew "jsonnet"

brew "gh"

brew "golang"
brew "nodejs"
brew "yarn"

brew "kubernetes-cli"
brew "krew"
brew "helm"
brew "minikube"
brew "kubeseal"

brew "hashicorp/tap/terraform"
brew "hashicorp/tap/vault"
