# Basic
brew "bat"
brew "btop"
brew "exa"
brew "fd"
brew "fish"
brew "fzf"
brew "gnupg"
brew "grpcurl"
brew "just"
brew "neovim"
brew "oha"
brew "ripgrep"
brew "sd"
brew "starship"
brew "tcptraceroute"
brew "tree"
brew "watch"
brew "xh"
brew "zoxide"

# Version control
brew "gh"
brew "git-filter-repo"
brew "glab"

# JSON & friends
brew "go-jsonnet"
brew "jq"
brew "yq"

# Programming
brew "go"
brew "fnm"
brew "rustup"

# Container
brew "argocd"
brew "helm"
brew "istioctl"
brew "knative/client/kn"
brew "ko"
brew "krew"
brew "kubernetes-cli"
brew "kubeseal"
brew "minikube"

# HashiCorp
brew "nomad"
brew "terraform"
brew "terragrunt"
brew "vault"

# Misc
brew "awscli@2"
brew "exercism"

# Cask
cask "homebrew/cask-fonts/font-jetbrains-mono"
cask "google-chrome"
cask "google-cloud-sdk"
cask "kitty"
cask "orbstack"
cask "visual-studio-code"
