# Basic
brew "ast-grep"
brew "atuin"
brew "bat"
brew "bore-cli"
brew "btop"
brew "croc"
brew "d2"
brew "dust"
brew "evil-helix"
brew "fd"
brew "fish"
brew "fzf"
brew "git-lfs"
brew "gnupg"
brew "grpcurl"
brew "just"
brew "lazygit"
brew "neovim"
brew "oha"
brew "ripgrep"
brew "sd"
brew "starship"
brew "tcpdump"
brew "tcptraceroute"
brew "tree"
brew "watch"
brew "xh"
brew "zoxide"

# Version control
brew "gh"
brew "git-filter-repo"
brew "glab"

# JSON & friends
brew "go-jsonnet"
brew "jq"
brew "yq"

# Programming
brew "composer"
brew "crystal"
brew "elixir"
brew "fnm"
brew "go"
brew "oven-sh/bun/bun"
brew "php"
brew "pipx"
brew "ruby"
brew "rustup"
brew "uv"

# Container
brew "argocd"
brew "helm"
brew "istioctl"
brew "knative/client/kn"
brew "ko"
brew "krew"
brew "kubernetes-cli"
brew "kubeseal"
brew "minikube"
brew "carvel-dev/carvel/kapp"
brew "carvel-dev/carvel/ytt"

# HashiCorp
brew "opentofu"
brew "hashicorp/tap/nomad"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/vault"
brew "terragrunt"

# Misc
brew "awscli@2"
brew "exercism"
brew "go-task"

# Cask
cask "betterdisplay"
cask "brave-browser"
cask "ghostty"
cask "orbstack"
cask "raycast"
cask "slack"
cask "visual-studio-code"
cask "wireshark"
